ID_TO_BY = {
    0:  {"code": "2.1",    "desc": "Главная дорога"},
    1:  {"code": "1.23",   "desc": "Дорожные работы"},
    2:  {"code": "1.17",   "desc": "Искусственная неровность"},
    3:  {"code": "3.24.1", "desc": "Ограничение скорости"},
    # РФ 8.2.1 -> РБ 7.2.1
    4:  {"code": "7.2.1",  "desc": "Зона действия"},
    5:  {"code": "5.20",   "desc": "Искусственная неровность"},
    # РФ 5.19.1 -> РБ 5.16.1
    6:  {"code": "5.16.1", "desc": "Пешеходный переход"},
    # РФ 5.16 -> РБ 5.12.1
    7:  {"code": "5.12.1", "desc": "Остановочный пункт"},
    8:  {"code": "3.25.1", "desc": "Конец огр. скорости"},
    # РФ 6.16 -> РБ 5.33
    9:  {"code": "5.33",   "desc": "Стоп-линия"},
    10: {"code": "7.15",   "desc": "Слепые пешеходы"},        # Табличка
    11: {"code": "2.2",    "desc": "Конец главной дороги"},
    12: {"code": "2.4",    "desc": "Уступите дорогу"},
    # РФ 8.13.1 -> РБ 7.13
    13: {"code": "7.13",   "desc": "Направление гл. дороги"},
    14: {"code": "4.2.1",  "desc": "Объезд препятствия справа"},
    15: {"code": "1.20.3", "desc": "Сужение дороги слева"},
    16: {"code": "1.25",   "desc": "Дикие животные"},
    17: {"code": "3.4",    "desc": "Движение грузовых запрещено"},
    # РФ 8.3.2 -> РБ 7.3.2
    18: {"code": "7.3.2",  "desc": "Направление действия"},
    19: {"code": "3.4.1",  "desc": "Движение грузовых запрещено"},
    20: {"code": "4.1.6",  "desc": "Движение направо или налево"},
    21: {"code": "4.2.3",  "desc": "Объезд препятствия спр. или сл."},
    22: {"code": "4.1.1",  "desc": "Движение прямо"},
    23: {"code": "1.30",   "desc": "Прочие опасности"},       # или 1.30
    # РФ 5.15.5 -> РБ 5.8.5
    24: {"code": "5.8.5",  "desc": "Конец полосы"},
    25: {"code": "3.27",   "desc": "Остановка запрещена"},
    26: {"code": "1.15",   "desc": "Скользкая дорога"},
    27: {"code": "4.1.2",  "desc": "Движение направо"},       # 4.1.2.1
    # РФ 6.3.1 -> РБ 6.3
    28: {"code": "6.3",    "desc": "Автозаправочная станция"},
    # РФ 8.1.1 -> РБ 7.1.1
    29: {"code": "7.1.1",  "desc": "Расстояние до объекта"},
    # РФ 6.7 -> РБ 6.7 (Сервис)
    30: {"code": "6.7",    "desc": "Пункт питания"},
    # РФ 5.15.3 -> РБ 5.8.3
    31: {"code": "5.8.3",  "desc": "Начало полосы"},
    # РФ 7.3 -> РБ 6.11? (надо смотреть иконку RTSD)
    32: {"code": "6.11",   "desc": "Пункт контроля"},
    # В РБ такого знака нет в гр 1, это желтый временный? Обычно 1.33
    33: {"code": "1.19",   "desc": "Опасная обочина"},
    34: {"code": "5.15",   "desc": "Место стоянки"},          # РФ 6.4 -> РБ 5.15
    35: {"code": "7.1.4",  "desc": "Расстояние до объекта"},
    36: {"code": "7.8",    "desc": "Платные услуги"},         # РФ 8.8 -> РБ 7.8
    37: {"code": "1.16.1", "desc": "Неровная дорога"},
    38: {"code": "1.11.2", "desc": "Опасный поворот налево"},
    39: {"code": "6.6",    "desc": "Телефон"},
    # РФ 5.15.1 -> РБ 5.8.1
    40: {"code": "5.8.1",  "desc": "Направления по полосам"},
    41: {"code": "6.2",    "desc": "Больница"},               # РФ 7.2 -> РБ 6.2
    # РФ 5.15.2 -> РБ 5.8.1
    42: {"code": "5.8.1",  "desc": "Направления по полосам"},
    # РФ 7.12 -> РБ 6.12
    43: {"code": "6.12",   "desc": "Пост ГАИ"},
    44: {"code": "3.18.1", "desc": "Поворот направо запрещен"},
    45: {"code": "5.6",    "desc": "Конец дороги с реверс. движ."},
    46: {"code": "5.5",    "desc": "Дорога с реверсивным движ."},
    47: {"code": "6.4",    "desc": "Техническое обслуживание"},  # РФ 7.4 -> РБ 6.4
    48: {"code": "4.1.2",  "desc": "Движение направо"},
    # РФ 8.2.2 -> РБ 7.2.2
    49: {"code": "7.2.2",  "desc": "Зона действия"},
    # РФ 7.11 -> РБ 6.11
    50: {"code": "6.11",   "desc": "Место отдыха"},
    51: {"code": "1.22",   "desc": "Пешеходный переход"},     # Предупреждающий
    52: {"code": "1.27",   "desc": "Боковой ветер"},
    53: {"code": "2.3.2",  "desc": "Примыкание второстепенной"},
    54: {"code": "5.8.2",  "desc": "Направление движения по полосе"},
    55: {"code": "1.8",    "desc": "Светофорное регулирование"},
    56: {"code": "3.13",   "desc": "Ограничение высоты"},
    57: {"code": "2.3.1",  "desc": "Пересечение со второстепенной"},
    58: {"code": "7.3.3",  "desc": "Направление действия"},
    59: {"code": "2.3.3",  "desc": "Примыкание второстепенной"},
    60: {"code": "6.8",    "desc": "Пункт контроля авт. перевозок"},  # РФ 7.7
    61: {"code": "1.11.1", "desc": "Опасный поворот направо"},
    62: {"code": "7.13",   "desc": "Направление гл. дороги"},  # РФ 8.13 -> РБ 7.13
    63: {"code": "1.12.2", "desc": "Опасные повороты"},
    64: {"code": "1.20.1", "desc": "Сужение дороги"},
    65: {"code": "1.12.1", "desc": "Опасные повороты"},
    66: {"code": "3.32",   "desc": "Движение с опасными грузами запр."},
    67: {"code": "2.5",    "desc": "Движение без остановки запр."},
    68: {"code": "3.1",    "desc": "Въезд запрещен"},
    69: {"code": "4.8.2",  "desc": "Направление движ. опасных грузов"},
    70: {"code": "3.20",   "desc": "Обгон запрещен"},
    71: {"code": "3.2",    "desc": "Движение запрещено"},
    # Специфичный РФ, в РБ аналогичен 2.3.x
    72: {"code": "2.3.6",  "desc": "Примыкание второстепенной"},
    73: {"code": "5.22",   "desc": "Конец жилой зоны"},
    74: {"code": "5.18",   "desc": "Рекомендуемая скорость"},
    75: {"code": "2.3.5",  "desc": "Примыкание второстепенной"},
    76: {"code": "6.5",    "desc": "Мойка автомобилей"},      # РФ 7.5 -> РБ 6.5
    # РФ 8.4.1 -> РБ 7.4.1
    77: {"code": "7.4.1",  "desc": "Вид транспортного средства"},
    78: {"code": "3.14",   "desc": "Ограничение ширины"},
    79: {"code": "1.2",    "desc": "Ж/д переезд без шлагбаума"},
    80: {"code": "1.20.2", "desc": "Сужение дороги справа"},
    81: {"code": "4.1.4",  "desc": "Движение прямо или направо"},
    82: {"code": "6.6",    "desc": "Телефон"},                # РФ 7.6 -> РБ 6.6
    83: {"code": "7.1.3",  "desc": "Расстояние до объекта"},  # РФ 8.1.3
    84: {"code": "7.3.1",  "desc": "Направление действия"},
    85: {"code": "4.3",    "desc": "Круговое движение"},
    86: {"code": "4.1.5",  "desc": "Движение прямо или налево"},
    87: {"code": "7.2.3",  "desc": "Зона действия"},
    88: {"code": "7.2.4",  "desc": "Зона действия"},
    89: {"code": "1.31.1", "desc": "Направление поворота"},
    90: {"code": "3.10",   "desc": "Движение пешеходов запрещено"},
    91: {"code": "4.2.2",  "desc": "Объезд препятствия слева"},
    92: {"code": "6.1",    "desc": "Пункт первой помощи"},    # РФ 7.1 -> РБ 6.1
    93: {"code": "3.28",   "desc": "Стоянка запрещена"},
    94: {"code": "4.1.3",  "desc": "Движение налево"},
    95: {"code": "5.4",    "desc": "Конец дороги с одностор. движ."},
    96: {"code": "5.3",    "desc": "Дорога с односторонним движ."},
    # ОШИБКА В RTSD LABEL? 6_8_2 это туалет. РБ 6.9
    97: {"code": "5.8.2",  "desc": "Туалет"},
    98: {"code": "3.31",   "desc": "Конец всех ограничений"},
    99: {"code": "6.2",    "desc": "Больница"},
    100: {"code": "1.21",  "desc": "Двустороннее движение"},
    101: {"code": "3.21",  "desc": "Конец зоны запр. обгона"},
    102: {"code": "1.13",  "desc": "Крутой спуск"},
    103: {"code": "1.14",  "desc": "Крутой подъем"},
    104: {"code": "2.3.4", "desc": "Примыкание второстепенной"},
    105: {"code": "4.8.3", "desc": "Направление движ. опасных грузов"},
    106: {"code": "5.15",  "desc": "Парковка"},
    107: {"code": "2.6",   "desc": "Преимущество встречного движ."},
    108: {"code": "3.18.2", "desc": "Поворот налево запрещен"},
    109: {"code": "4.1.3", "desc": "Движение налево"},
    110: {"code": "1.7",   "desc": "Пересечение с круговым движ."},
    111: {"code": "3.19",  "desc": "Разворот запрещен"},
    112: {"code": "1.18",  "desc": "Выброс гравия"},
    113: {"code": "2.7",   "desc": "Преимущество перед встречным"},
    # РФ 8.5.4 -> РБ 7.5.4
    114: {"code": "7.5.4", "desc": "Время действия"},
    115: {"code": "5.8.7", "desc": "Направление движ. по полосам"},
    116: {"code": "5.14",  "desc": "Полоса для маршрутных ТС"},  # В РБ знак 5.9
    117: {"code": "5.21",  "desc": "Жилая зона"},
    118: {"code": "1.1",   "desc": "Ж/д переезд со шлагбаумом"},
    # РФ 6.15.1 -> РБ 6.10
    119: {"code": "5.15",  "desc": "Место отдыха"},
    # РФ 8.6.4 -> РБ 7.6.4
    120: {"code": "7.6.4", "desc": "Способ постановки на стоянку"},
    # РФ 8.15 -> РБ 7.15
    121: {"code": "7.15",  "desc": "Слепые пешеходы"},
    122: {"code": "4.5.1", "desc": "Велосипедная дорожка"},
    123: {"code": "3.11.1", "desc": "Ограничение массы"},
    # РФ 8.18 -> РБ 7.18
    124: {"code": "7.18",  "desc": "Кроме инвалидов"},
    125: {"code": "7.4.4", "desc": "Вид ТС (Автобус)"},
    126: {"code": "3.30",  "desc": "Стоянка запр. по четным"},
    127: {"code": "5.7.1", "desc": "Выезд на дорогу с одностор. движ."},
    128: {"code": "5.7.2", "desc": "Выезд на дорогу с одностор. движ."},
    129: {"code": "1.5",   "desc": "Пересечение с трамвайной линией"},
    130: {"code": "3.29",  "desc": "Стоянка запр. по нечетным"},
    # В РБ знак 6.11-6.14
    131: {"code": "6.11",  "desc": "Кемпинг"},
    # Или конец полосы МТС (5.10) - завист от картинки 5.12
    132: {"code": "5.12.2", "desc": "Конец остановочного пункта"},
    133: {"code": "3.16",  "desc": "Ограничение дистанции"},
    134: {"code": "1.30",  "desc": "Прочие опасности"},
    # РФ 5.11 -> РБ 5.9.1
    135: {"code": "5.9.1", "desc": "Полоса для маршрутных ТС"},
    136: {"code": "1.6",   "desc": "Пересечение равнозначных дорог"},
    # РФ 8.6.2 -> РБ 7.6.2
    137: {"code": "7.6.2", "desc": "Способ постановки на стоянку"},
    138: {"code": "6.9",   "desc": "Душ"},                    # РФ 6.8.3
    139: {"code": "3.12",  "desc": "Ограничение нагрузки на ось"},
    140: {"code": "3.33",  "desc": "Движение с взрывчатыми вещ. запр."},
    141: {"code": "7.4.3", "desc": "Вид ТС (Легковые)"},
    142: {"code": "5.8.1", "desc": "Направления движ. по полосам"},
    # РФ 8.14 -> РБ 7.14
    143: {"code": "7.14",  "desc": "Полоса движения"},
    # РФ 8.17 -> РБ 7.17
    144: {"code": "7.17",  "desc": "Инвалиды"},
    145: {"code": "3.6",   "desc": "Движение мотоциклов запрещено"},
    146: {"code": "1.26",  "desc": "Падение камней"},
    # РФ 8.5.2 -> РБ 7.5.2
    147: {"code": "7.5.2", "desc": "Рабочие дни"},
    148: {"code": "6.8",   "desc": "Питьевая вода"},
    149: {"code": "5.17.1", "desc": "Подземный пеш. переход"},  # РФ 5.17
    150: {"code": "1.10",  "desc": "Выезд на набережную"},
    # РФ 8.16 -> РБ 7.16
    151: {"code": "7.16",  "desc": "Влажное покрытие"},
    152: {"code": "6.15",  "desc": "Пост транспортного контроля"},  # РФ 7.18
    153: {"code": "7.14",  "desc": "Полоса движения"},        # РФ 7.14
    154: {"code": "7.23",  "desc": "Экстренная помощь"}       # РФ 8.23
}
